# jupyter 사용방법

실행은 block 별로 된다!! 그래서 하나하나 끊어서 할 수 있다!!! 

실행은 위에서 세모랑 작대기 붙어있는 것 눌러서 해도되지만 

shift + enter치면 바로됨!! 기억하기!!

다른 단축키는 help -> keyboard shortcuts에 있음!!

In [3]:
from pandas import DataFrame
import pandas as pd
import json
import csv
import numpy as np
import re

In [2]:
#csv파일 읽는 것은 read_csv로 
data_aisles = pd.read_csv("./capstone_data/aisles.csv")
data_departments = pd.read_csv("./capstone_data/departments.csv")
data_orders = pd.read_csv("./capstone_data/orders.csv")
data_product = pd.read_csv("./capstone_data/products.csv")
data_order_products = pd.read_csv("./capstone_data/order_products__prior.csv")

In [5]:
#데이터에서 aisle field에 존재하는 unique한 데이터 갯수 확인하고 싶을 때
print("unique한 aisle 갯수 : "),
print(len(data_aisles.aisle.unique()))

unique한 aisle 갯수 :  134

In [28]:
#데이터 앞에 5개만 보는 것 .head() , 마지막 5개만 보고싶으면 .tail() 사용, []괄호 안에 범위 설정
#data_aisles.head()

In [4]:
data_order_products.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [29]:
# dataframe의 전체 record수 확인
print("total number of records : "),
print(data_aisles.shape[0])

total number of records :  134

In [10]:
print("total number of records : "),
print(data_departments.shape[0])

total number of records :  21

In [18]:
print("total number of records : "),
print(data_order_products.shape[0])

total number of records :  32434489

In [11]:
#Unique한 데이터 갯수
len(data_orders.order_id.unique())

3421083

In [13]:
len(data_orders.order_hour_of_day.unique())

24

## 특정 위치에 있는 record보는 방법

In [17]:
data_order_products[0:10]

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0
5         2       17794                  6          1
6         2       40141                  7          1
7         2        1819                  8          1
8         2       43668                  9          0
9         3       33754                  1          1

In [20]:
#97번째 데이터보기
data_aisles.loc[97]

aisle_id               98
aisle       juice nectars
Name: 97, dtype: object

In [22]:
data_aisles.loc[25]

aisle_id        26
aisle       coffee
Name: 25, dtype: object

## # 특정 컬럼에서 특정 값이 있는 record만 보는 방법

In [26]:

data_product.loc[data_product['department_id'] == 7].head()

,product_id,product_name,aisle_id,department_id
2,3,Robust Golden Unsweetened Oolong Tea,94,7
6,7,Pure Coconut Water With Orange,98,7
9,10,Sparkling Orange Juice & Prickly Pear Beverage,115,7
10,11,Peach Mango Juice,31,7
19,20,Pomegranate Cranberry & Aloe Vera Enrich Drink,98,7

In [92]:
data_aisles.loc[data_aisles['aisle']=='instant foods']

   aisle_id          aisle
3         4  instant foods